// Тиунов Роман РИС-26-3б Вариант 22 Лабораторная 2 
#include <iostream>
#include <clocale>
#include <cmath>

using namespace std;

int main() 
{
    setlocale(LC_ALL, ".65001"); // подключаем русскою локализацию

    long double s = 0;
    int count = 15; // количество членов ряда

    // Начинаем с n = 2, так как при n = 1 ln(1) = 0 (деление на ноль)
    for (int n = 2; n < 2 + count; n++) {
        long double an = pow(n, log(n)) / pow(log(n), n); // вычисление текущего члена ряда по формуле
        s += an; // суммирование элементов
    }

    cout << "Сумма 15 членов ряда = " << s << endl;

    return 0;
} 

/* Анализ задачи
1) Формула общего члена ряда: a_n = n^(ln(n)) / (ln(n))^n
2) Поскольку при n = 1 знаменатель обращается в 0 (ln 1 = 0), расчет 15 членов ряда начинается с n = 2
3) В цикле for для возведения в степень используется функция pow(), а для натурального логарифма — log()
4) Переменная s накапливает сумму всех 15 элементов */