// Тиунов Роман РИС-26-36 Вариант 22 Лабораторная 1 задание 2
#include <iostream> // подключаем библиотеку ввода-вывода
#include <clocale> //  подключаем библиотеку для локализации

using namespace std; // подключаем пространство имен std

int main() {
    setlocale(LC_ALL, ".65001"); // подключаем русскую локализацию
    int n, m;
    cout << "Введи целый числа n и m: "; // просим пользователя ввести два целых числа
    cin >> n >> m; // считываем два целых числа с клавиатуры
    cout << "\nРезультаты выражения:" << endl; 
    cout << "1) ++n * ++m = " << (++n * ++m) << endl; 
    // префиксный инкремент увеличивает n и m до операции умножения
    cout << "2) m++ < n  = " << (m++ < n) << endl;
    // постфиксный инкремент у m срабатывает уже после сравнения
    cout << "3) n++ > m  = " << (n++ > m) << endl;
    // постфиксный инкремент у n срабатывает уже после сравнения
    return 0;
}

/*Префиксный инкремент (++n, ++m) сначала увеличивает значение переменной на единицу, а затем подставляет её в текущую операцию.
При исходных n = 5 и m = 3 переменные сначала стали равны 6 и 4, после чего их произведения выдало 6 * 4 = 24.
Постфиксный инкремент (m++, n++) сначала участвует в текущем выражении (сравнении) со своим исходным значением, и только после этого увеличивается на единицу.
Это позволяет корректно выстраивать логические цепочки сравнений в строках 2 и 3, где результаты логических выражений возвращают единицу*/