// Тиунов Роман РИС-26-3б Вариант 22 Лабораторная 1 задание 1
#include <iostream> // подключаем библиотеку ввода-вывода
#include <iomanip> // подключаем библиотеку для форматирования вывода

using namespace std; // подключаем пространство имен std

int main() 
{
    setlocale(LC_ALL, ".65001"); // подключаем русскую локализацию
    cout << fixed << setprecision(6); //отключает экспоненциальную запись чисел
    double a = 100.0; // задаем переменную double a 
    double b = 0.001; // задаем переменную double b

    float af = a; //копируем переменную из double
    float bf = b; //копируем переменную из double
    float p1 = (af - bf) * (af - bf) * (af - bf) * (af - bf);//поэтапно считает пример
    float p2 = af * af * af * af - 4.0f * af * af * af * bf; 
    float chisl1 = p1 - p2;
    float znam1 = 6.0f * af * af * bf * bf - 4.0f * af * bf * bf * bf + bf * bf * bf * bf;
    float r1 = chisl1 / znam1; 
    cout<<"Первая часть числителя: " << p1<< endl;
    cout<<"Вторая часть числителя: "<<p2<<endl;
    cout<<"Числитель: "<<chisl1<<endl;
    cout<<"Знаменатель: "<<znam1<<endl;
    cout << "Значение для float: " << r1 << endl<<endl;  //вывод данных float

    double dp1 = (a - b) * (a - b) * (a - b) * (a - b); //поэтапно считаем пример
    double dp2 = a * a * a * a - 4.0 * a * a * a * b;
    double chisl2 = dp1 - dp2;
    double znam2 = 6.0 * a * a * b * b - 4.0 * a * b * b * b + b * b * b * b;
    double r2 = chisl2 / znam2;
    cout<<"Первая часть числителя: " << dp1<< endl;
    cout<<"Вторая часть числителя: "<<dp2<<endl;
    cout<<"Числитель: "<<chisl2<<endl;
    cout<<"Знаменатель: "<<znam2<<endl;
    cout << "Значение для double: " << r2 << endl; //вывод данных double

    return 0;
}

/*Объяснение
Тип float выделяет под число 4 байта(32 бита) из-за чего мантисса вмещает меньше значащих цифр
При попытке выполнить операции с сильно различающимися по величине числами (a = 100 и b = 0.001) а затем возвести их в высокие степени, происходит критическая потеря точности (округление).
// . Из-за этого промежуточные результаты в числителе и знаменателе искажаются,что видно на примере числителя и итоговое значение обнуляется.
Тип double выделяет 8 байт(64 бита) обеспечивает большую разрядность. Это позволяет корректно сохранить все значащие цифры при вычислениях с мелкими приращениями.
Математически исходная формула после сокращений должна давать единицу, что тип double  и демонстритрует (1.000000)
Благодаря этому он справляется с задачей, где float даёт погрешность*/