// Тиунов Роман РИС-26-3б Вариант 22 Лабораторная 1 задание 2
#include <iostream>

using namespace std;

int main() {
    int n, m;
    cout << "Vvedi celie chisla n i m: ";
    cin >> n >> m;

    cout << "\nRezultati virazheniy dlya 22 varianta:" << endl;
    cout << "1) ++n * ++m = " << (++n * ++m) << endl;
    cout << "2) m++ < n   = " << (m++ < n) << endl;
    cout << "3) n++ > m   = " << (n++ > m) << endl;

    return 0;
}

/*Префиксный инкремент (++n, ++m) сначала увеличивает значение переменной на единицу, а затем подставляет её в текущую операцию.
При исходных n = 5 и m = 3 переменные сначала стали равны 6 и 4, после чего их произведения выдало 6 * 4 = 24.
Постфиксный инкремент (m++, n++) сначала участвует в текущем выражении (сравнении) со своим исходным значением, и только после этого увеличивается на единицу.
Это позволяет корректно выстраивать логические цепочки сравнений в строках 2 и 3, где результаты логических выражений возвращают единицу*/